-------------------------------------------------------------------------------
-- 定义通用的映射选项
-------------------------------------------------------------------------------

local opts = {
    -- 非递归映射（不会触发其他映射）
    noremap = true,
    -- 静默执行（不显示执行信息）
    silent = true,
}

-------------------------------------------------------------------------------
-- 普通模式
-------------------------------------------------------------------------------

-- 使用方向键调整窗口大小
-- 窗口高度增加 1
vim.keymap.set('n', '<C-Up>', ':resize +1<CR>', opts)
-- 窗口高度减小 1
vim.keymap.set('n', '<C-Down>', ':resize -1<CR>', opts)
-- 窗口宽度减小 1
vim.keymap.set('n', '<C-Left>', ':vertical resize -1<CR>', opts)
-- 窗口宽度增加 1
vim.keymap.set('n', '<C-Right>', ':vertical resize +1<CR>', opts)

-------------------------------------------------------------------------------
-- 可视模式
-------------------------------------------------------------------------------

-- 缩进/反缩进后保持选中区域，方便连续缩进/反缩进
vim.keymap.set('v', '<', '<gv', opts)
vim.keymap.set('v', '>', '>gv', opts)

